ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_romdriver_e907.c
/**
  ******************************************************************************
  * @file    bl606p_romdriver_e907.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2021 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
  
#include "bl606p_romdriver_e907.h"
#include <string.h>

/** @addtogroup  BL606P_Periph_Driver
 *  @{
 */

/** @defgroup ROMDRIVER
 *  @brief ROMDRIVER common functions
 *  @{
 */

/** @defgroup ROMDRIVER_Private_Type
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Type*/

/** @defgroup ROMDRIVER_Private_Defines
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Defines */

/** @defgroup ROMDRIVER_Private_Variables
 *  @{
 */                               

/*@} end of group ROMDRIVER_Private_Variables */

/** @defgroup ROMDRIVER_Global_Variables
 *  @{
 */ 
 

uint32_t const romDriverTable[]={
    0x08080001,
    0x00000000,
    0x00000000,
    0x00000000,


    [ROM_API_INDEX_AON_LowPower_Enter_PDS0]                = (uint32_t)AON_LowPower_Enter_PDS0,
    [ROM_API_INDEX_AON_LowPower_Exit_PDS0]                 = (uint32_t)AON_LowPower_Exit_PDS0,
    [ROM_API_INDEX_AON_Power_Off_BG]                       = (uint32_t)AON_Power_Off_BG,
    [ROM_API_INDEX_AON_Power_Off_LDO15_RF]                 = (uint32_t)AON_Power_Off_LDO15_RF,
    [ROM_API_INDEX_AON_Power_Off_MBG]                      = (uint32_t)AON_Power_Off_MBG,
    [ROM_API_INDEX_AON_Power_Off_SFReg]                    = (uint32_t)AON_Power_Off_SFReg,
    [ROM_API_INDEX_AON_Power_Off_XTAL]                     = (uint32_t)AON_Power_Off_XTAL,
    [ROM_API_INDEX_AON_Power_On_BG]                        = (uint32_t)AON_Power_On_BG,
    [ROM_API_INDEX_AON_Power_On_LDO15_RF]                  = (uint32_t)AON_Power_On_LDO15_RF,
    [ROM_API_INDEX_AON_Power_On_MBG]                       = (uint32_t)AON_Power_On_MBG,
    [ROM_API_INDEX_AON_Power_On_SFReg]                     = (uint32_t)AON_Power_On_SFReg,
    [ROM_API_INDEX_AON_Power_On_XTAL]                      = (uint32_t)AON_Power_On_XTAL,
    [ROM_API_INDEX_AON_Set_Xtal_CapCode]                   = (uint32_t)AON_Set_Xtal_CapCode,
    [ROM_API_INDEX_AON_Get_Xtal_CapCode]                   = (uint32_t)AON_Get_Xtal_CapCode,

    [ROM_API_INDEX_CPU_MTimer_Delay_MS]                    = (uint32_t)CPU_MTimer_Delay_MS,
    [ROM_API_INDEX_CPU_MTimer_Delay_US]                    = (uint32_t)CPU_MTimer_Delay_US,
    [ROM_API_INDEX_CPU_Reset_MTimer]                       = (uint32_t)CPU_Reset_MTimer,
    [ROM_API_INDEX_CPU_Set_MTimer_CLK]                     = (uint32_t)CPU_Set_MTimer_CLK,
    [ROM_API_INDEX_CPU_Set_MTimer_RST]                     = (uint32_t)CPU_Set_MTimer_RST,
    [ROM_API_INDEX_CPU_Get_MTimer_Clock]                   = (uint32_t)CPU_Get_MTimer_Clock,
    [ROM_API_INDEX_CPU_Get_MTimer_Source_Clock]            = (uint32_t)CPU_Get_MTimer_Source_Clock,

    [ROM_API_INDEX_Clock_Audio_ADC_Clock_Get]              = (uint32_t)Clock_Audio_ADC_Clock_Get,
    [ROM_API_INDEX_Clock_Audio_DAC_Clock_Get]              = (uint32_t)Clock_Audio_DAC_Clock_Get,
    [ROM_API_INDEX_Clock_Get_BLAI_Clk]                     = (uint32_t)Clock_Get_BLAI_Clk,
    [ROM_API_INDEX_Clock_Get_Display_Clk]                  = (uint32_t)Clock_Get_Display_Clk,
    [ROM_API_INDEX_Clock_Get_EMI_Clk]                      = (uint32_t)Clock_Get_EMI_Clk,
    [ROM_API_INDEX_Clock_Get_H264_Clk]                     = (uint32_t)Clock_Get_H264_Clk,
    [ROM_API_INDEX_Clock_Get_ISP_Clk]                      = (uint32_t)Clock_Get_ISP_Clk,
    [ROM_API_INDEX_Clock_Get_PSRAMB_Clk]                   = (uint32_t)Clock_Get_PSRAMB_Clk,
    [ROM_API_INDEX_Clock_Peripheral_Clock_Get]             = (uint32_t)Clock_Peripheral_Clock_Get,
    [ROM_API_INDEX_Clock_System_Clock_Get]                 = (uint32_t)Clock_System_Clock_Get,

    [ROM_API_INDEX_SystemCoreClockGet]                     = (uint32_t)SystemCoreClockGet,

    [ROM_API_INDEX_CPU_Get_CPU_Cycle]                      = (uint32_t)CPU_Get_CPU_Cycle,
    [ROM_API_INDEX_CPU_Get_MTimer_Counter]                 = (uint32_t)CPU_Get_MTimer_Counter,
    [ROM_API_INDEX_CPU_Get_MTimer_MS]                      = (uint32_t)CPU_Get_MTimer_MS,
    [ROM_API_INDEX_CPU_Get_MTimer_US]                      = (uint32_t)CPU_Get_MTimer_US,

    [ROM_API_INDEX_ASM_Delay_Us]                           = (uint32_t)ASM_Delay_Us,

    [ROM_API_INDEX_arch_delay_ms]                          = (uint32_t)arch_delay_ms,
    [ROM_API_INDEX_arch_delay_us]                          = (uint32_t)arch_delay_us,

