ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_romdriver_e907.c
    [ROM_API_INDEX_EF_Ctrl_Crc_Result]                     = (uint32_t)EF_Ctrl_Crc_Result,
    [ROM_API_INDEX_EF_Ctrl_Get_Customer_PIDVID]            = (uint32_t)EF_Ctrl_Get_Customer_PIDVID,
    [ROM_API_INDEX_EF_Ctrl_Read_Chip_ID]                   = (uint32_t)EF_Ctrl_Read_Chip_ID,
    [ROM_API_INDEX_EF_Ctrl_Read_MAC_Address]               = (uint32_t)EF_Ctrl_Read_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Raw]           = (uint32_t)EF_Ctrl_Read_MAC_Address_Raw,
    [ROM_API_INDEX_EF_Ctrl_AutoLoad_Done]                  = (uint32_t)EF_Ctrl_AutoLoad_Done,
    [ROM_API_INDEX_EF_Ctrl_Busy]                           = (uint32_t)EF_Ctrl_Busy,
    [ROM_API_INDEX_EF_Ctrl_Crc_Is_Busy]                    = (uint32_t)EF_Ctrl_Crc_Is_Busy,
    [ROM_API_INDEX_EF_Ctrl_Get_Trim_Parity]                = (uint32_t)EF_Ctrl_Get_Trim_Parity,
    [ROM_API_INDEX_EF_Ctrl_Is_All_Bits_Zero]               = (uint32_t)EF_Ctrl_Is_All_Bits_Zero,
    [ROM_API_INDEX_EF_Ctrl_Clear]                          = (uint32_t)EF_Ctrl_Clear,
    [ROM_API_INDEX_EF_Ctrl_Crc_Enable]                     = (uint32_t)EF_Ctrl_Crc_Enable,
    [ROM_API_INDEX_EF_Ctrl_Crc_Set_Golden]                 = (uint32_t)EF_Ctrl_Crc_Set_Golden,
    [ROM_API_INDEX_EF_Ctrl_Load_Efuse_R0]                  = (uint32_t)EF_Ctrl_Load_Efuse_R0,
    [ROM_API_INDEX_EF_Ctrl_Load_Efuse_R1]                  = (uint32_t)EF_Ctrl_Load_Efuse_R1,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct]                 = (uint32_t)EF_Ctrl_Program_Direct,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct_R0]              = (uint32_t)EF_Ctrl_Program_Direct_R0,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct_R1]              = (uint32_t)EF_Ctrl_Program_Direct_R1,
    [ROM_API_INDEX_EF_Ctrl_Program_Efuse_0]                = (uint32_t)EF_Ctrl_Program_Efuse_0,
    [ROM_API_INDEX_EF_Ctrl_Program_Efuse_1]                = (uint32_t)EF_Ctrl_Program_Efuse_1,
    [ROM_API_INDEX_EF_Ctrl_Read_ADC_Gain_Trim]             = (uint32_t)EF_Ctrl_Read_ADC_Gain_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_AES_Key]                   = (uint32_t)EF_Ctrl_Read_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Read_Dbg_Pwd]                   = (uint32_t)EF_Ctrl_Read_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Read_Device_Info]               = (uint32_t)EF_Ctrl_Read_Device_Info,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct]                    = (uint32_t)EF_Ctrl_Read_Direct,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct_R0]                 = (uint32_t)EF_Ctrl_Read_Direct_R0,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct_R1]                 = (uint32_t)EF_Ctrl_Read_Direct_R1,
    [ROM_API_INDEX_EF_Ctrl_Read_LDO18IO_Vout_Trim]         = (uint32_t)EF_Ctrl_Read_LDO18IO_Vout_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_RC32K_Trim]                = (uint32_t)EF_Ctrl_Read_RC32K_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_RC32M_Trim]                = (uint32_t)EF_Ctrl_Read_RC32M_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_Secure_Boot]               = (uint32_t)EF_Ctrl_Read_Secure_Boot,
    [ROM_API_INDEX_EF_Ctrl_Read_Secure_Cfg]                = (uint32_t)EF_Ctrl_Read_Secure_Cfg,
    [ROM_API_INDEX_EF_Ctrl_Read_Sw_Usage]                  = (uint32_t)EF_Ctrl_Read_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Read_TSEN_Trim]                 = (uint32_t)EF_Ctrl_Read_TSEN_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_Xtal_Trim_RC32M]           = (uint32_t)EF_Ctrl_Read_Xtal_Trim_RC32M,
    [ROM_API_INDEX_EF_Ctrl_Readlock_AES_Key]               = (uint32_t)EF_Ctrl_Readlock_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Readlock_Dbg_Pwd]               = (uint32_t)EF_Ctrl_Readlock_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Set_sf_key_re_sel]              = (uint32_t)EF_Ctrl_Set_sf_key_re_sel,
    [ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_0]                   = (uint32_t)EF_Ctrl_Sw_AHB_Clk_0,
    [ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_1]                   = (uint32_t)EF_Ctrl_Sw_AHB_Clk_1,
    [ROM_API_INDEX_EF_Ctrl_Write_AES_Key]                  = (uint32_t)EF_Ctrl_Write_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Write_Dbg_Pwd]                  = (uint32_t)EF_Ctrl_Write_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Write_MAC_Address]              = (uint32_t)EF_Ctrl_Write_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Write_Secure_Boot]              = (uint32_t)EF_Ctrl_Write_Secure_Boot,
    [ROM_API_INDEX_EF_Ctrl_Write_Secure_Cfg]               = (uint32_t)EF_Ctrl_Write_Secure_Cfg,
    [ROM_API_INDEX_EF_Ctrl_Write_Sw_Usage]                 = (uint32_t)EF_Ctrl_Write_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Writelock_AES_Key]              = (uint32_t)EF_Ctrl_Writelock_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Writelock_Dbg_Pwd]              = (uint32_t)EF_Ctrl_Writelock_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Writelock_MAC_Address]          = (uint32_t)EF_Ctrl_Writelock_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Writelock_Sw_Usage]             = (uint32_t)EF_Ctrl_Writelock_Sw_Usage,

    [ROM_API_INDEX_GLB_AHB_DSP_Software_Reset]             = (uint32_t)GLB_AHB_DSP_Software_Reset,
    [ROM_API_INDEX_GLB_AHB_MCU_Software_Reset]             = (uint32_t)GLB_AHB_MCU_Software_Reset,
    [ROM_API_INDEX_GLB_BMX_TO_Init]                        = (uint32_t)GLB_BMX_TO_Init,
    [ROM_API_INDEX_GLB_Clr_BMX_TO_Status]                  = (uint32_t)GLB_Clr_BMX_TO_Status,
    [ROM_API_INDEX_GLB_Clr_EMI_Reset_Gate]                 = (uint32_t)GLB_Clr_EMI_Reset_Gate,
    [ROM_API_INDEX_GLB_DSP0_Clock_Disable]                 = (uint32_t)GLB_DSP0_Clock_Disable,
    [ROM_API_INDEX_GLB_DSP0_Clock_Enable]                  = (uint32_t)GLB_DSP0_Clock_Enable,
    [ROM_API_INDEX_GLB_DSP_Clr_MCU_IntStatus]              = (uint32_t)GLB_DSP_Clr_MCU_IntStatus,
    [ROM_API_INDEX_GLB_DSP_Codec_Sub_Reset]                = (uint32_t)GLB_DSP_Codec_Sub_Reset,
    [ROM_API_INDEX_GLB_DSP_ISP_Sub_Reset]                  = (uint32_t)GLB_DSP_ISP_Sub_Reset,
    [ROM_API_INDEX_GLB_DSP_Image_Sensor_Reset]             = (uint32_t)GLB_DSP_Image_Sensor_Reset,
    [ROM_API_INDEX_GLB_DSP_Peripheral_Reset]               = (uint32_t)GLB_DSP_Peripheral_Reset,
    [ROM_API_INDEX_GLB_DSP_SW_System_Reset]                = (uint32_t)GLB_DSP_SW_System_Reset,
    [ROM_API_INDEX_GLB_DSP_Set_LP_IntEn]                   = (uint32_t)GLB_DSP_Set_LP_IntEn,
    [ROM_API_INDEX_GLB_DSP_Set_MCU_IntMask]                = (uint32_t)GLB_DSP_Set_MCU_IntMask,
    [ROM_API_INDEX_GLB_Get_Auto_Calc_Xtal_Type]            = (uint32_t)GLB_Get_Auto_Calc_Xtal_Type,
    [ROM_API_INDEX_GLB_Get_DSP_PBCLK_Div]                  = (uint32_t)GLB_Get_DSP_PBCLK_Div,
    [ROM_API_INDEX_GLB_Get_DSP_System_CLK_Div]             = (uint32_t)GLB_Get_DSP_System_CLK_Div,
    [ROM_API_INDEX_GLB_Get_MCU_System_CLK_Div]             = (uint32_t)GLB_Get_MCU_System_CLK_Div,
    [ROM_API_INDEX_GLB_Halt_CPU]                           = (uint32_t)GLB_Halt_CPU,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Disable]              = (uint32_t)GLB_IR_LED_Driver_Disable,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Enable]               = (uint32_t)GLB_IR_LED_Driver_Enable,
    [ROM_API_INDEX_GLB_IR_RX_GPIO_Sel]                     = (uint32_t)GLB_IR_RX_GPIO_Sel,
    [ROM_API_INDEX_GLB_Invert_ETH_REF_O_CLK]               = (uint32_t)GLB_Invert_ETH_REF_O_CLK,
    [ROM_API_INDEX_GLB_Invert_ETH_RX_CLK]                  = (uint32_t)GLB_Invert_ETH_RX_CLK,
    [ROM_API_INDEX_GLB_Invert_ETH_TX_CLK]                  = (uint32_t)GLB_Invert_ETH_TX_CLK,
    [ROM_API_INDEX_GLB_MCU_Clr_DSP_IntStatus]              = (uint32_t)GLB_MCU_Clr_DSP_IntStatus,
    [ROM_API_INDEX_GLB_MCU_SW_System_Reset]                = (uint32_t)GLB_MCU_SW_System_Reset,
    [ROM_API_INDEX_GLB_MCU_Set_DSP_IntMask]                = (uint32_t)GLB_MCU_Set_DSP_IntMask,
    [ROM_API_INDEX_GLB_PER_Clock_Gate]                     = (uint32_t)GLB_PER_Clock_Gate,
    [ROM_API_INDEX_GLB_PER_Clock_UnGate]                   = (uint32_t)GLB_PER_Clock_UnGate,
    [ROM_API_INDEX_GLB_PLL_CGEN_Clock_Gate]                = (uint32_t)GLB_PLL_CGEN_Clock_Gate,
    [ROM_API_INDEX_GLB_PLL_CGEN_Clock_UnGate]              = (uint32_t)GLB_PLL_CGEN_Clock_UnGate,
    [ROM_API_INDEX_GLB_Platform_Wakeup_PDS_Enable]         = (uint32_t)GLB_Platform_Wakeup_PDS_Enable,
    [ROM_API_INDEX_GLB_Power_Off_MU_PLL]                   = (uint32_t)GLB_Power_Off_MU_PLL,
    [ROM_API_INDEX_GLB_Power_Off_WAC_PLL]                  = (uint32_t)GLB_Power_Off_WAC_PLL,
    [ROM_API_INDEX_GLB_Power_On_MU_PLL]                    = (uint32_t)GLB_Power_On_MU_PLL,
    [ROM_API_INDEX_GLB_Power_On_WAC_PLL]                   = (uint32_t)GLB_Power_On_WAC_PLL,
    [ROM_API_INDEX_GLB_Power_On_XTAL_And_PLL_CLK]          = (uint32_t)GLB_Power_On_XTAL_And_PLL_CLK,
    [ROM_API_INDEX_GLB_Release_CPU]                        = (uint32_t)GLB_Release_CPU,
    [ROM_API_INDEX_GLB_SW_CPU_Reset]                       = (uint32_t)GLB_SW_CPU_Reset,
    [ROM_API_INDEX_GLB_SW_POR_Reset]                       = (uint32_t)GLB_SW_POR_Reset,
    [ROM_API_INDEX_GLB_SW_System_Reset]                    = (uint32_t)GLB_SW_System_Reset,
    [ROM_API_INDEX_GLB_Sel_DSP_TMR_GPIO_Clock]             = (uint32_t)GLB_Sel_DSP_TMR_GPIO_Clock,
    [ROM_API_INDEX_GLB_Sel_MCU_TMR_GPIO_Clock]             = (uint32_t)GLB_Sel_MCU_TMR_GPIO_Clock,
    [ROM_API_INDEX_GLB_Set_ADC_CLK]                        = (uint32_t)GLB_Set_ADC_CLK,
    [ROM_API_INDEX_GLB_Set_Audio_ADC_CLK]                  = (uint32_t)GLB_Set_Audio_ADC_CLK,
    [ROM_API_INDEX_GLB_Set_Audio_AUTO_CLK]                 = (uint32_t)GLB_Set_Audio_AUTO_CLK,
    [ROM_API_INDEX_GLB_Set_Audio_DAC_CLK]                  = (uint32_t)GLB_Set_Audio_DAC_CLK,
    [ROM_API_INDEX_GLB_Set_Audio_PDM_CLK]                  = (uint32_t)GLB_Set_Audio_PDM_CLK,
    [ROM_API_INDEX_GLB_Set_Auto_Calc_Xtal_Type]            = (uint32_t)GLB_Set_Auto_Calc_Xtal_Type,
    [ROM_API_INDEX_GLB_Set_CAM_CLK]                        = (uint32_t)GLB_Set_CAM_CLK,
    [ROM_API_INDEX_GLB_Set_CPU_Reset_Address]              = (uint32_t)GLB_Set_CPU_Reset_Address,
    [ROM_API_INDEX_GLB_Set_CSI_DSI_CLK_Sel]                = (uint32_t)GLB_Set_CSI_DSI_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_Chip_Clock_Out_Sel]             = (uint32_t)GLB_Set_Chip_Clock_Out_Sel,
    [ROM_API_INDEX_GLB_Set_DIG_32K_CLK]                    = (uint32_t)GLB_Set_DIG_32K_CLK,
    [ROM_API_INDEX_GLB_Set_DIG_512K_CLK]                   = (uint32_t)GLB_Set_DIG_512K_CLK,
    [ROM_API_INDEX_GLB_Set_DIG_CLK_Sel]                    = (uint32_t)GLB_Set_DIG_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_DMA_CLK]                        = (uint32_t)GLB_Set_DMA_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_CNN_CLK]                    = (uint32_t)GLB_Set_DSP_CNN_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_DP_CLK]                     = (uint32_t)GLB_Set_DSP_DP_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_H264_CLK]                   = (uint32_t)GLB_Set_DSP_H264_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_I2C0_CLK]                   = (uint32_t)GLB_Set_DSP_I2C0_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_I2C1_CLK]                   = (uint32_t)GLB_Set_DSP_I2C1_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_ISP_CLK]                    = (uint32_t)GLB_Set_DSP_ISP_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_MTimer_CLK]                 = (uint32_t)GLB_Set_DSP_MTimer_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_MUXPLL_CLK_Sel]             = (uint32_t)GLB_Set_DSP_MUXPLL_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_Muxpll_160M_Sel]            = (uint32_t)GLB_Set_DSP_Muxpll_160M_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_Muxpll_240M_Sel]            = (uint32_t)GLB_Set_DSP_Muxpll_240M_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_Muxpll_320M_Sel]            = (uint32_t)GLB_Set_DSP_Muxpll_320M_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_PBCLK]                      = (uint32_t)GLB_Set_DSP_PBCLK,
    [ROM_API_INDEX_GLB_Set_DSP_PBCLK_Div]                  = (uint32_t)GLB_Set_DSP_PBCLK_Div,
    [ROM_API_INDEX_GLB_Set_DSP_PBROOT_CLK_Sel]             = (uint32_t)GLB_Set_DSP_PBROOT_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_ROOT_CLK_Sel]               = (uint32_t)GLB_Set_DSP_ROOT_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_SPI_0_ACT_MOD_Sel]          = (uint32_t)GLB_Set_DSP_SPI_0_ACT_MOD_Sel,
    [ROM_API_INDEX_GLB_Set_DSP_SPI_CLK]                    = (uint32_t)GLB_Set_DSP_SPI_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_System_CLK]                 = (uint32_t)GLB_Set_DSP_System_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_System_CLK_Div]             = (uint32_t)GLB_Set_DSP_System_CLK_Div,
    [ROM_API_INDEX_GLB_Set_DSP_UART0_CLK]                  = (uint32_t)GLB_Set_DSP_UART0_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_UART1_CLK]                  = (uint32_t)GLB_Set_DSP_UART1_CLK,
    [ROM_API_INDEX_GLB_Set_DSP_XCLK_Sel]                   = (uint32_t)GLB_Set_DSP_XCLK_Sel,
    [ROM_API_INDEX_GLB_Set_Display_CLK]                    = (uint32_t)GLB_Set_Display_CLK,
    [ROM_API_INDEX_GLB_Set_EMI_CLK]                        = (uint32_t)GLB_Set_EMI_CLK,
    [ROM_API_INDEX_GLB_Set_EM_Sel]                         = (uint32_t)GLB_Set_EM_Sel,
    [ROM_API_INDEX_GLB_Set_ETH_REF_O_CLK_Sel]              = (uint32_t)GLB_Set_ETH_REF_O_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_Ethernet_CLK_From_UHSPLL]       = (uint32_t)GLB_Set_Ethernet_CLK_From_UHSPLL,
    [ROM_API_INDEX_GLB_Set_Flash_IO_PARM]                  = (uint32_t)GLB_Set_Flash_IO_PARM,
    [ROM_API_INDEX_GLB_Set_I2C_CLK]                        = (uint32_t)GLB_Set_I2C_CLK,
    [ROM_API_INDEX_GLB_Set_I2S_CLK]                        = (uint32_t)GLB_Set_I2S_CLK,
    [ROM_API_INDEX_GLB_Set_IR_CLK]                         = (uint32_t)GLB_Set_IR_CLK,
    [ROM_API_INDEX_GLB_Set_MCU_MTimer_CLK]                 = (uint32_t)GLB_Set_MCU_MTimer_CLK,
    [ROM_API_INDEX_GLB_Set_MCU_Muxpll_160M_Sel]            = (uint32_t)GLB_Set_MCU_Muxpll_160M_Sel,
    [ROM_API_INDEX_GLB_Set_MCU_Muxpll_80M_Sel]             = (uint32_t)GLB_Set_MCU_Muxpll_80M_Sel,
    [ROM_API_INDEX_GLB_Set_MCU_SPI_0_ACT_MOD_Sel]          = (uint32_t)GLB_Set_MCU_SPI_0_ACT_MOD_Sel,
    [ROM_API_INDEX_GLB_Set_MCU_System_CLK]                 = (uint32_t)GLB_Set_MCU_System_CLK,
    [ROM_API_INDEX_GLB_Set_MCU_System_CLK_Div]             = (uint32_t)GLB_Set_MCU_System_CLK_Div,
    [ROM_API_INDEX_GLB_Set_PADC_CLK]                       = (uint32_t)GLB_Set_PADC_CLK,
    [ROM_API_INDEX_GLB_Set_PDM_IO_Sel]                     = (uint32_t)GLB_Set_PDM_IO_Sel,
    [ROM_API_INDEX_GLB_Set_PKA_CLK_Sel]                    = (uint32_t)GLB_Set_PKA_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_PSram_CLK]                      = (uint32_t)GLB_Set_PSram_CLK,
    [ROM_API_INDEX_GLB_Set_PWM1_IO_Sel]                    = (uint32_t)GLB_Set_PWM1_IO_Sel,
    [ROM_API_INDEX_GLB_Set_PWM2_IO_Sel]                    = (uint32_t)GLB_Set_PWM2_IO_Sel,
    [ROM_API_INDEX_GLB_Set_Peripheral_DMA_CN]              = (uint32_t)GLB_Set_Peripheral_DMA_CN,
    [ROM_API_INDEX_GLB_Set_SDH_CLK]                        = (uint32_t)GLB_Set_SDH_CLK,
    [ROM_API_INDEX_GLB_Set_SF_CLK]                         = (uint32_t)GLB_Set_SF_CLK,
    [ROM_API_INDEX_GLB_Set_SPI_CLK]                        = (uint32_t)GLB_Set_SPI_CLK,
    [ROM_API_INDEX_GLB_Set_SRAM_PARM]                      = (uint32_t)GLB_Set_SRAM_PARM,
    [ROM_API_INDEX_GLB_Set_SRAM_RET]                       = (uint32_t)GLB_Set_SRAM_RET,
    [ROM_API_INDEX_GLB_Set_SRAM_SLP]                       = (uint32_t)GLB_Set_SRAM_SLP,
    [ROM_API_INDEX_GLB_Set_UART2_IO_Sel]                   = (uint32_t)GLB_Set_UART2_IO_Sel,
    [ROM_API_INDEX_GLB_Set_UART_CLK]                       = (uint32_t)GLB_Set_UART_CLK,
    [ROM_API_INDEX_GLB_Set_USB_CLK_From_WIFIPLL]           = (uint32_t)GLB_Set_USB_CLK_From_WIFIPLL,
    [ROM_API_INDEX_GLB_Swap_DSP_SPI_0_MOSI_With_MISO]      = (uint32_t)GLB_Swap_DSP_SPI_0_MOSI_With_MISO,
    [ROM_API_INDEX_GLB_Swap_MCU_SPI_0_MOSI_With_MISO]      = (uint32_t)GLB_Swap_MCU_SPI_0_MOSI_With_MISO,
    [ROM_API_INDEX_GLB_Trim_LDO18IO_Vout]                  = (uint32_t)GLB_Trim_LDO18IO_Vout,
    [ROM_API_INDEX_GLB_UART_Fun_Sel]                       = (uint32_t)GLB_UART_Fun_Sel,
    [ROM_API_INDEX_GLB_UART_Sig_Swap_Set]                  = (uint32_t)GLB_UART_Sig_Swap_Set,
    [ROM_API_INDEX_GLB_DSP_Get_LP_IntStatus]               = (uint32_t)GLB_DSP_Get_LP_IntStatus,
    [ROM_API_INDEX_GLB_DSP_Get_MCU_IntStatus]              = (uint32_t)GLB_DSP_Get_MCU_IntStatus,
    [ROM_API_INDEX_GLB_MCU_Get_DSP_IntStatus]              = (uint32_t)GLB_MCU_Get_DSP_IntStatus,
    [ROM_API_INDEX_GLB_Get_Core_Type]                      = (uint32_t)GLB_Get_Core_Type,
    [ROM_API_INDEX_GLB_Get_DSP_Muxpll_160M_Sel]            = (uint32_t)GLB_Get_DSP_Muxpll_160M_Sel,
    [ROM_API_INDEX_GLB_Get_DSP_Muxpll_240M_Sel]            = (uint32_t)GLB_Get_DSP_Muxpll_240M_Sel,
    [ROM_API_INDEX_GLB_Get_DSP_Muxpll_320M_Sel]            = (uint32_t)GLB_Get_DSP_Muxpll_320M_Sel,
    [ROM_API_INDEX_GLB_Get_DSP_PBROOT_CLK_Sel]             = (uint32_t)GLB_Get_DSP_PBROOT_CLK_Sel,
    [ROM_API_INDEX_GLB_Get_DSP_ROOT_CLK_Sel]               = (uint32_t)GLB_Get_DSP_ROOT_CLK_Sel,
    [ROM_API_INDEX_GLB_Get_DSP_XCLK_Sel]                   = (uint32_t)GLB_Get_DSP_XCLK_Sel,
    [ROM_API_INDEX_GLB_Get_MCU_Muxpll_160M_Sel]            = (uint32_t)GLB_Get_MCU_Muxpll_160M_Sel,
    [ROM_API_INDEX_GLB_Get_MCU_Muxpll_80M_Sel]             = (uint32_t)GLB_Get_MCU_Muxpll_80M_Sel,
    [ROM_API_INDEX_GLB_Get_SRAM_PARM]                      = (uint32_t)GLB_Get_SRAM_PARM,
    [ROM_API_INDEX_GLB_Get_SRAM_RET]                       = (uint32_t)GLB_Get_SRAM_RET,
    [ROM_API_INDEX_GLB_Get_SRAM_SLP]                       = (uint32_t)GLB_Get_SRAM_SLP,
    [ROM_API_INDEX_GLB_Get_BMX_TO_Status]                  = (uint32_t)GLB_Get_BMX_TO_Status,
    [ROM_API_INDEX_GLB_Clr_GPIO_IntStatus]                 = (uint32_t)GLB_Clr_GPIO_IntStatus,
    [ROM_API_INDEX_GLB_Embedded_Flash_Pad_Enable]          = (uint32_t)GLB_Embedded_Flash_Pad_Enable,
    [ROM_API_INDEX_GLB_GPIO_Clr]                           = (uint32_t)GLB_GPIO_Clr,
    [ROM_API_INDEX_GLB_GPIO_Fifo_Clear]                    = (uint32_t)GLB_GPIO_Fifo_Clear,
    [ROM_API_INDEX_GLB_GPIO_Fifo_Init]                     = (uint32_t)GLB_GPIO_Fifo_Init,
    [ROM_API_INDEX_GLB_GPIO_Fifo_IntClear]                 = (uint32_t)GLB_GPIO_Fifo_IntClear,
    [ROM_API_INDEX_GLB_GPIO_Fifo_IntMask]                  = (uint32_t)GLB_GPIO_Fifo_IntMask,
    [ROM_API_INDEX_GLB_GPIO_Fifo_Push]                     = (uint32_t)GLB_GPIO_Fifo_Push,
    [ROM_API_INDEX_GLB_GPIO_Func_Init]                     = (uint32_t)GLB_GPIO_Func_Init,
    [ROM_API_INDEX_GLB_GPIO_Init]                          = (uint32_t)GLB_GPIO_Init,
    [ROM_API_INDEX_GLB_GPIO_Input_Disable]                 = (uint32_t)GLB_GPIO_Input_Disable,
    [ROM_API_INDEX_GLB_GPIO_Input_Enable]                  = (uint32_t)GLB_GPIO_Input_Enable,
    [ROM_API_INDEX_GLB_GPIO_IntMask]                       = (uint32_t)GLB_GPIO_IntMask,
    [ROM_API_INDEX_GLB_GPIO_Int_Init]                      = (uint32_t)GLB_GPIO_Int_Init,
    [ROM_API_INDEX_GLB_GPIO_Output_Disable]                = (uint32_t)GLB_GPIO_Output_Disable,
    [ROM_API_INDEX_GLB_GPIO_Output_Enable]                 = (uint32_t)GLB_GPIO_Output_Enable,
    [ROM_API_INDEX_GLB_GPIO_Set]                           = (uint32_t)GLB_GPIO_Set,
    [ROM_API_INDEX_GLB_GPIO_Set_HZ]                        = (uint32_t)GLB_GPIO_Set_HZ,
    [ROM_API_INDEX_GLB_GPIO_Write]                         = (uint32_t)GLB_GPIO_Write,
    [ROM_API_INDEX_GLB_GPIO_Fifo_Disable]                  = (uint32_t)GLB_GPIO_Fifo_Disable,
    [ROM_API_INDEX_GLB_GPIO_Fifo_Enable]                   = (uint32_t)GLB_GPIO_Fifo_Enable,
    [ROM_API_INDEX_GLB_GPIO_Fifo_GetIntStatus]             = (uint32_t)GLB_GPIO_Fifo_GetIntStatus,
    [ROM_API_INDEX_GLB_Get_GPIO_IntStatus]                 = (uint32_t)GLB_Get_GPIO_IntStatus,
    [ROM_API_INDEX_GLB_GPIO_Fifo_GetCount]                 = (uint32_t)GLB_GPIO_Fifo_GetCount,
    [ROM_API_INDEX_GLB_GPIO_Read]                          = (uint32_t)GLB_GPIO_Read,
    [ROM_API_INDEX_GLB_GPIO_Get_Fun]                       = (uint32_t)GLB_GPIO_Get_Fun,

