ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_romdriver_e907.c
    [ROM_API_INDEX_UART_AutoBaudDetection]                 = (uint32_t)UART_AutoBaudDetection,
    [ROM_API_INDEX_UART_ClrRtsValue]                       = (uint32_t)UART_ClrRtsValue,
    [ROM_API_INDEX_UART_ClrTxValue]                        = (uint32_t)UART_ClrTxValue,
    [ROM_API_INDEX_UART_DeInit]                            = (uint32_t)UART_DeInit,
    [ROM_API_INDEX_UART_Disable]                           = (uint32_t)UART_Disable,
    [ROM_API_INDEX_UART_Enable]                            = (uint32_t)UART_Enable,
    [ROM_API_INDEX_UART_FifoConfig]                        = (uint32_t)UART_FifoConfig,
    [ROM_API_INDEX_UART_GetBitWidth0X55]                   = (uint32_t)UART_GetBitWidth0X55,
    [ROM_API_INDEX_UART_Init]                              = (uint32_t)UART_Init,
    [ROM_API_INDEX_UART_IntClear]                          = (uint32_t)UART_IntClear,
    [ROM_API_INDEX_UART_IntMask]                           = (uint32_t)UART_IntMask,
    [ROM_API_INDEX_UART_IrConfig]                          = (uint32_t)UART_IrConfig,
    [ROM_API_INDEX_UART_RxFifoClear]                       = (uint32_t)UART_RxFifoClear,
    [ROM_API_INDEX_UART_SendData]                          = (uint32_t)UART_SendData,
    [ROM_API_INDEX_UART_SendDataBlock]                     = (uint32_t)UART_SendDataBlock,
    [ROM_API_INDEX_UART_SetAllowableError0X55]             = (uint32_t)UART_SetAllowableError0X55,
    [ROM_API_INDEX_UART_SetBaudrate]                       = (uint32_t)UART_SetBaudrate,
    [ROM_API_INDEX_UART_SetDeglitchCount]                  = (uint32_t)UART_SetDeglitchCount,
    [ROM_API_INDEX_UART_SetRS485]                          = (uint32_t)UART_SetRS485,
    [ROM_API_INDEX_UART_SetRtsValue]                       = (uint32_t)UART_SetRtsValue,
    [ROM_API_INDEX_UART_SetRxByteCount]                    = (uint32_t)UART_SetRxByteCount,
    [ROM_API_INDEX_UART_SetRxDataLength]                   = (uint32_t)UART_SetRxDataLength,
    [ROM_API_INDEX_UART_SetRxTimeoutValue]                 = (uint32_t)UART_SetRxTimeoutValue,
    [ROM_API_INDEX_UART_SetTxDataLength]                   = (uint32_t)UART_SetTxDataLength,
    [ROM_API_INDEX_UART_SetTxValue]                        = (uint32_t)UART_SetTxValue,
    [ROM_API_INDEX_UART_TxFifoClear]                       = (uint32_t)UART_TxFifoClear,
    [ROM_API_INDEX_UART_TxFreeRun]                         = (uint32_t)UART_TxFreeRun,
    [ROM_API_INDEX_UART_GetIntStatus]                      = (uint32_t)UART_GetIntStatus,
    [ROM_API_INDEX_UART_GetOverflowStatus]                 = (uint32_t)UART_GetOverflowStatus,
    [ROM_API_INDEX_UART_GetRxBusBusyStatus]                = (uint32_t)UART_GetRxBusBusyStatus,
    [ROM_API_INDEX_UART_GetTxBusBusyStatus]                = (uint32_t)UART_GetTxBusBusyStatus,
    [ROM_API_INDEX_UART_GetAutoBaudCount]                  = (uint32_t)UART_GetAutoBaudCount,
    [ROM_API_INDEX_UART_GetRxByteCount]                    = (uint32_t)UART_GetRxByteCount,
    [ROM_API_INDEX_UART_ReceiveData]                       = (uint32_t)UART_ReceiveData,
    [ROM_API_INDEX_UART_GetRxFifoCount]                    = (uint32_t)UART_GetRxFifoCount,
    [ROM_API_INDEX_UART_GetTxFifoCount]                    = (uint32_t)UART_GetTxFifoCount,

    [ROM_API_INDEX_XIP_SFlash_Erase_Need_Lock]             = (uint32_t)XIP_SFlash_Erase_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_GetDeviceId_Need_Lock]       = (uint32_t)XIP_SFlash_GetDeviceId_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_GetJedecId_Need_Lock]        = (uint32_t)XIP_SFlash_GetJedecId_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_GetUniqueId_Need_Lock]       = (uint32_t)XIP_SFlash_GetUniqueId_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Read_Need_Lock]              = (uint32_t)XIP_SFlash_Read_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Read_Via_Cache_Need_Lock]    = (uint32_t)XIP_SFlash_Read_Via_Cache_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_State_Restore]               = (uint32_t)XIP_SFlash_State_Restore,
    [ROM_API_INDEX_XIP_SFlash_State_Save]                  = (uint32_t)XIP_SFlash_State_Save,
    [ROM_API_INDEX_XIP_SFlash_Write_Need_Lock]             = (uint32_t)XIP_SFlash_Write_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Opt_Enter]                   = (uint32_t)XIP_SFlash_Opt_Enter,
    [ROM_API_INDEX_XIP_SFlash_Opt_Exit]                    = (uint32_t)XIP_SFlash_Opt_Exit,

    [ROM_API_INDEX_FUNC_EMPTY_START ... ROM_API_INDEX_FUNC_EMPTY_END] = 0xdeedbeef,
};


/*@} end of group ROMDRIVER_Global_Variables */

/** @defgroup ROMDRIVER_Private_FunctionDeclaration
 *  @{
 */

/*@} end of group ROMDRIVER_Private_FunctionDeclaration */

/** @defgroup ROMDRIVER_Private_Functions
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Functions */

/** @defgroup ROMDRIVER_Public_Functions
 *  @{
 */

/*@} end of group ROMDRIVER_Public_Functions */

/*@} end of group ROMDRIVER_COMMON */

/*@} end of group BL606P_Periph_Driver */


